README.org
#+property: header-args :eval never-export
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
#+PROPERTY: mkdirp yes
* Introduction

This [[https://github.com/shrysr/shiny-exploration][repo]] will serve as a learning and exploration ground to build shiny apps from the ground-up. It will include references, notes and the scripts to reproduce the apps.

Planned Approach:
- Re-implement examples that I find from scratch, and in parallel explore other aspects and variations of the code.
- Apply the concepts learned to develop my own shiny apps.
- Tools used:
  - Emacs and Org-mode (source blocks in Org-babel) have been used to create this document and scripts, ala Literate programming.
  - Source blocks are tangled into respective app folders and RStudio was used to quickly run and reload apps for testing. (This is just more convenient than launching the web browser from Emacs.)

* References
The references below were instrumental in the learning procedure and also function as a source of inspiration.

Note: Relevant references and links are also placed alongside the code in each section.

1. Rstudio documentation [[https://shiny.rstudio.com/tutorial/][link]]
   - Free video tutorials from Datacamp sponsored by Rstudio. There are links to advanced articles, as well as written tutorials. This is a good resource to get started.
2. Sales revenue dashboard with Rshiny and ShinyDashboard [[https://datascienceplus.com/building-a-simple-sales-revenue-dashboard-with-r-shiny-shinydashboard/][link]]

* Shiny Tutorials - Rstudio [5/6]

Re-implementing [[https://shiny.rstudio.com/tutorial/][Rstudio's tutorials]] with minor tweaks and additional explorations in some areas.

** DONE Lesson 1
CLOSED: [2019-01-24 Thu 13:22]
*** Installing the shiny library

#+BEGIN_SRC R :session *R:shiny-exploration
install.packages("shiny")
#+END_SRC

