README.html

<div id="outline-container-org79ef7d2" class="outline-4">
<h4 id="org79ef7d2"><span class="section-number-4">3.1.3</span> Running in-built shiny examples</h4>
<div class="outline-text-4" id="text-3-1-3">
<div class="org-src-container">
<pre class="src src-R">runExample(<span style="color: #008000;">"01_hello"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcddda58" class="outline-4">
<h4 id="orgcddda58"><span class="section-number-4">3.1.4</span> <a href="file:///app-01/">app-01</a></h4>
<div class="outline-text-4" id="text-3-1-4">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #D0372D;">library</span>(shiny)

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Define UI for app that draws a histogram ----</span>
ui <span style="color: #D0372D;">&lt;-</span> fluidPage(

  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">App title ----</span>
  titlePanel(<span style="color: #008000;">"Hello Shiny!"</span>),

  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Sidebar layout with input and output definitions ----</span>
  sidebarLayout(

    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Sidebar panel for inputs ----</span>
    sidebarPanel(

      <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Input: Slider for the number of bins ----</span>
      sliderInput(inputId = <span style="color: #008000;">"bins"</span>,
                  label = <span style="color: #008000;">"Number of bins:"</span>,
                  min = 1,
                  max = 50,
                  value = 30)

    ),

    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Main panel for displaying outputs ----</span>
    mainPanel(

      <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Output: Histogram ----</span>
      plotOutput(outputId = <span style="color: #008000;">"distPlot"</span>)

    )
  )
)

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Define server logic required to draw a histogram ----</span>
<span style="color: #006699;">server</span> <span style="color: #D0372D;">&lt;-</span> <span style="color: #0000FF;">function</span>(input, output) {

  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Histogram of the Old Faithful Geyser Data ----</span>
  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">with requested number of bins</span>
  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">This expression that generates a histogram is wrapped in a call</span>
  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">to renderPlot to indicate that:</span>
  <span style="color: #8D8D84;">#</span>
  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">1. It is "reactive" and therefore should be automatically</span>
  <span style="color: #8D8D84;">#    </span><span style="color: #8D8D84; font-style: italic;">re-executed when inputs (input$bins) change</span>
  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">2. Its output type is a plot</span>

  output$distPlot <span style="color: #D0372D;">&lt;-</span> renderPlot({

    x    <span style="color: #D0372D;">&lt;-</span> faithful$waiting
    bins <span style="color: #D0372D;">&lt;-</span> seq(min(x), max(x), length.out = input$bins + 1)

    hist(x, breaks = bins, col = <span style="color: #008000;">"#75AADB"</span>, border = <span style="color: #008000;">"white"</span>,
         xlab = <span style="color: #008000;">"Waiting time to next eruption (in mins)"</span>,
         main = <span style="color: #008000;">"Histogram of waiting times"</span>)

    })

}

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Create Shiny app ----</span>
shinyApp(ui = ui, server = server)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org12fbdbe" class="outline-3">
<h3 id="org12fbdbe"><span class="section-number-3">3.2</span> <span class="done DONE">DONE</span> Lesson 2</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org00b9844" class="outline-4">
<h4 id="org00b9844"><span class="section-number-4">3.2.1</span> Starting with custom app</h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #D0372D;">library</span>(shiny)

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define UI</span>
ui  <span style="color: #D0372D;">&lt;-</span> fluidPage(

    titlePanel(<span style="color: #008000;">"This is the title"</span>),

    sidebarLayout(
        sidebarPanel(<span style="color: #008000;">"Hello panel"</span>,
                     h2(<span style="color: #008000;">"This is h2 title in the sidepanel"</span>)),
        mainPanel(<span style="color: #008000;">"main panel"</span>,
                  h1(<span style="color: #008000;">"Another title in h1"</span>, align = <span style="color: #008000;">"center"</span>)
                  ),
<span style="color: #8D8D84;">#        </span><span style="color: #8D8D84; font-style: italic;">position = "right"</span>
    )

)
<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define server logic</span>

<span style="color: #006699;">server</span> <span style="color: #D0372D;">&lt;-</span> <span style="color: #0000FF;">function</span>(input, output){


}



<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Run the app</span>
shinyApp(ui = ui, server = server)
</pre>
</div>
</div>
</div>

<div id="outline-container-org372c79c" class="outline-4">
<h4 id="org372c79c"><span class="section-number-4">3.2.2</span> Test app for formatting difference highlight</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #D0372D;">library</span>(shiny)

ui <span style="color: #D0372D;">&lt;-</span> fluidPage(
  titlePanel(<span style="color: #008000;">"My Shiny App"</span>),
  sidebarLayout(
    sidebarPanel(),
    mainPanel(
      p(<span style="color: #008000;">"p creates a paragraph of text."</span>),
      p(<span style="color: #008000;">"A new p() command starts a new paragraph. Supply a style attribute to change the format of the entire paragraph."</span>, style = <span style="color: #008000;">"font-family: 'times'; font-si16pt"</span>),
      strong(<span style="color: #008000;">"strong() makes bold text."</span>),
      em(<span style="color: #008000;">"em() creates italicized (i.e, emphasized) text."</span>),
      br(),
      code(<span style="color: #008000;">"code displays your text similar to computer code"</span>),
      div(<span style="color: #008000;">"div creates segments of text with a similar style. This division of text is all blue because I passed the argument 'style = color:blue' to div"</span>, style = <span style="color: #008000;">"color:blue"</span>),
      br(),
      p(<span style="color: #008000;">"span does the same thing as div, but it works with"</span>,
        span(<span style="color: #008000;">"groups of words"</span>, style = <span style="color: #008000;">"color:blue"</span>),
        <span style="color: #008000;">"that appear inside a paragraph."</span>)
    )
  )
)


<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Run the app</span>
shinyApp(ui = ui, server = server)
</pre>
</div>
</div>
</div>
