README.md


<a id="orgd9a587a"></a>

### Running in-built shiny examples

    runExample("01_hello")


<a id="org619f1c5"></a>

### [app-01](file:///app-01/)

    library(shiny)

    # Define UI for app that draws a histogram ----
    ui <- fluidPage(

      # App title ----
      titlePanel("Hello Shiny!"),

      # Sidebar layout with input and output definitions ----
      sidebarLayout(

        # Sidebar panel for inputs ----
        sidebarPanel(

          # Input: Slider for the number of bins ----
          sliderInput(inputId = "bins",
                      label = "Number of bins:",
                      min = 1,
                      max = 50,
                      value = 30)

        ),

        # Main panel for displaying outputs ----
        mainPanel(

          # Output: Histogram ----
          plotOutput(outputId = "distPlot")

        )
      )
    )

    # Define server logic required to draw a histogram ----
    server <- function(input, output) {

      # Histogram of the Old Faithful Geyser Data ----
      # with requested number of bins
      # This expression that generates a histogram is wrapped in a call
      # to renderPlot to indicate that:
      #
      # 1. It is "reactive" and therefore should be automatically
      #    re-executed when inputs (input$bins) change
      # 2. Its output type is a plot

      output$distPlot <- renderPlot({

        x    <- faithful$waiting
        bins <- seq(min(x), max(x), length.out = input$bins + 1)

        hist(x, breaks = bins, col = "#75AADB", border = "white",
             xlab = "Waiting time to next eruption (in mins)",
             main = "Histogram of waiting times")

        })

    }

    # Create Shiny app ----
    shinyApp(ui = ui, server = server)


<a id="org8427540"></a>

## DONE Lesson 2


<a id="orgafe3929"></a>

### Starting with custom app

    library(shiny)

    ## Define UI
    ui  <- fluidPage(

        titlePanel("This is the title"),

        sidebarLayout(
            sidebarPanel("Hello panel",
                         h2("This is h2 title in the sidepanel")),
            mainPanel("main panel",
                      h1("Another title in h1", align = "center")
                      ),
    #        position = "right"
        )

    )
    ## Define server logic

    server <- function(input, output){


    }



    ## Run the app
    shinyApp(ui = ui, server = server)


<a id="org7723c92"></a>

### Test app for formatting difference highlight

    library(shiny)

    ui <- fluidPage(
      titlePanel("My Shiny App"),
      sidebarLayout(
        sidebarPanel(),
        mainPanel(
          p("p creates a paragraph of text."),
          p("A new p() command starts a new paragraph. Supply a style attribute to change the format of the entire paragraph.", style = "font-family: 'times'; font-si16pt"),
          strong("strong() makes bold text."),
          em("em() creates italicized (i.e, emphasized) text."),
          br(),
          code("code displays your text similar to computer code"),
          div("div creates segments of text with a similar style. This division of text is all blue because I passed the argument 'style = color:blue' to div", style = "color:blue"),
          br(),
          p("span does the same thing as div, but it works with",
            span("groups of words", style = "color:blue"),
            "that appear inside a paragraph.")
        )
      )
    )
