README.org
*** Testing knowledge. [[/app-02/][See app-02]]
:PROPERTIES:
:ID:       5FE10AA0-1E81-48D9-85E9-8E782EB2E935
:END:

#+BEGIN_SRC R :session *R:shiny-exploration* :tangle ./app-02/app.R
library(shiny)

## Define UI
ui  <- fluidPage(
    titlePanel("My Shiny App"),

    sidebarLayout(
        sidebarPanel(h1("Installation"),
                     p("Shiny is available on CRAN, so you can install it the usual way using:"),
                     br(),
                     code('install.packages("shiny")'),
                     img(src="rstudio.png", height = 70, width = 200),
                     p("Shiny is a product of ", a("Rstudio",
                                                 href="http://www.shiny.rstudio.com"))
                     ),
        mainPanel()
    )
)


## Define server logic
server <- function(input, output){}



## Run the app
shinyApp(ui = ui, server = server)
#+END_SRC

#+RESULTS:

** DONE Lesson 3 Multiple columns
CLOSED: [2019-01-28 Mon 09:46]
