README.html

<div id="outline-container-org902bfd3" class="outline-4">
<h4 id="org902bfd3"><span class="section-number-4">3.2.3</span> Testing knowledge. <a href="file:///app-02/">See app-02</a></h4>
<div class="outline-text-4" id="text-3-2-3">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #D0372D;">library</span>(shiny)

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define UI</span>
ui  <span style="color: #D0372D;">&lt;-</span> fluidPage(
    titlePanel(<span style="color: #008000;">"My Shiny App"</span>),

    sidebarLayout(
        sidebarPanel(h1(<span style="color: #008000;">"Installation"</span>),
                     p(<span style="color: #008000;">"Shiny is available on CRAN, so you can install it the usual way using:"</span>),
                     br(),
                     code(<span style="color: #008000;">'install.packages("shiny")'</span>),
                     img(src=<span style="color: #008000;">"rstudio.png"</span>, height = 70, width = 200),
                     p(<span style="color: #008000;">"Shiny is a product of "</span>, a(<span style="color: #008000;">"Rstudio"</span>,
                                                 href=<span style="color: #008000;">"http://www.shiny.rstudio.com"</span>))
                     ),
        mainPanel()
    )
)


<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define server logic</span>
<span style="color: #006699;">server</span> <span style="color: #D0372D;">&lt;-</span> <span style="color: #0000FF;">function</span>(input, output){}



<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Run the app</span>
shinyApp(ui = ui, server = server)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb0295f7" class="outline-3">
<h3 id="orgb0295f7"><span class="section-number-3">3.3</span> <span class="done DONE">DONE</span> Lesson 3 Multiple columns</h3>
<div class="outline-text-3" id="text-3-3">
</div>
