README.html
<div id="outline-container-org0367810" class="outline-4">
<h4 id="org0367810"><span class="section-number-4">3.3.1</span> Re-implementing example. <a href="file:///app-03/">See app-03</a></h4>
<div class="outline-text-4" id="text-3-3-1">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #D0372D;">library</span>(shiny)

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define UI</span>
ui  <span style="color: #D0372D;">&lt;-</span> fluidPage(
  titlePanel(<span style="color: #008000;">"Basic widget exploration"</span>),

  fluidRow(

    column(2,
           h3(<span style="color: #008000;">"buttons"</span>),
           actionButton(<span style="color: #008000;">"action007"</span>, label =<span style="color: #008000;">"Action"</span>),
           br(),
           br(),
           submitButton(<span style="color: #008000;">"Submit"</span>)
           ),
    column(2,
           h3(<span style="color: #008000;">"Single Checkbox"</span>),
           checkboxInput(<span style="color: #008000;">"checkbox"</span>, <span style="color: #008000;">"Choice A"</span>, value = T)
           ),
    column(3,
           checkboxGroupInput(<span style="color: #008000;">"checkGroup"</span>,
                              h3(<span style="color: #008000;">"checkbox group"</span>),
                              choices = list(<span style="color: #008000;">"Choice 1"</span> = 1,
                                             <span style="color: #008000;">"Choice 2"</span> = 2,
                                             <span style="color: #008000;">"Choice 3"</span> = 3
                                             ),
                              selected = 1
                              )
           ),
    column(2,
           dateInput(<span style="color: #008000;">"date"</span>,
                     h3(<span style="color: #008000;">"date input"</span>),
                     value = <span style="color: #008000;">""</span>
                     )
           )

  ),
  <span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Inserting another fluid row element</span>
  fluidRow(

    column(2,
           radioButtons(<span style="color: #008000;">"radio"</span>,
                        h3(<span style="color: #008000;">"Radio Buttons"</span>),
                        choices = list(<span style="color: #008000;">"choice 1"</span> = 1,
                                       <span style="color: #008000;">"choice 2"</span> = 2,
                                       <span style="color: #008000;">"Radio 3"</span>  = 3
                                       ),
                        selected =1
                        )
           ),

    column(2,
           selectInput(<span style="color: #008000;">"select"</span>,
                       h3(<span style="color: #008000;">"Select box"</span>),
                       choices = list(<span style="color: #008000;">"choice 1"</span> = 1,
                                      <span style="color: #008000;">"choice 2"</span> = 2,
                                      <span style="color: #008000;">"choice 3"</span> = 3
                                      ),
                       selected = 1
                       )
           ),
    column(2,
           sliderInput(<span style="color: #008000;">"slider1"</span>,
                       h3(<span style="color: #008000;">"Sliders"</span>),
                       min = 0,
                       max = 100,
                       value = 50
                       ),

           sliderInput(<span style="color: #008000;">"slider2"</span>,
                       h3(<span style="color: #008000;">"Another Slider"</span>),
                       min = 50,
                       max = 200,
                       value = c(60,80)
                       )
           ),
    column(2,
           selectInput(<span style="color: #008000;">"selectbox1"</span>,
                     h3(<span style="color: #008000;">"select from drop down box"</span>),
                     choices = list(<span style="color: #008000;">"choice 1"</span> = 22,
                                    <span style="color: #008000;">"choice 2"</span> = 2,
                                    <span style="color: #008000;">"choice fake 3"</span> = 33
                                    ),
                     selected = <span style="color: #008000;">""</span>
                     )
           )

  ),
  fluidRow(
    column(3,
           dateRangeInput(<span style="color: #008000;">"daterange"</span>,
                          h3(<span style="color: #008000;">"Date range input"</span>)
                          )
           ),

    column(3,
           fileInput(<span style="color: #008000;">"fileinput"</span>,
                     h3(<span style="color: #008000;">"Select File"</span>)
                     )
           ),

    column(3,
           numericInput(<span style="color: #008000;">"numinput"</span>,
                        h3(<span style="color: #008000;">"Enter numeric value"</span>),
                        value = 10
                        )
           ),
    column(3,
           h3(<span style="color: #008000;">"help text"</span>),
           helpText(<span style="color: #008000;">"Hello this is line one."</span>,
                    <span style="color: #008000;">"This is line 2..\n"</span>,
                    <span style="color: #008000;">"This is line 3."</span>
                    )
           )
  )
)


<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define server logic</span>

<span style="color: #006699;">server</span> <span style="color: #D0372D;">&lt;-</span> <span style="color: #0000FF;">function</span>(input, output){


}



<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Run the app</span>
shinyApp(ui = ui, server = server)
</pre>
</div>
</div>
</div>
