README.org
*** Init censusVis task. [[/app-04/][See app-04]]
:PROPERTIES:
:ID:       8D7695A3-C7D1-46CB-9AD9-052227DC61BB
:END:

#+BEGIN_SRC R :session *R:shiny-exploration* :tangle app-04/app.R
library(shiny)

## Define UI
ui  <- fluidPage(
  titlePanel("censusViz"),

  sidebarLayout(
    sidebarPanel(
      helpText("Create demographic maps with information form the 2010 US Census"),
      selectInput("inputbox1",
                  h2("Choose variable to display:"),
                  choices = list("Percent White" = 1,
                                 "Percent Black" = 2,
                                 "Percent Hispanic" = 3,
                                 "Percent Asian" = 4
                                 ),
                  selected = ""
                  ),
      sliderInput("slider1",
                  h2("Range of interest:"),
                  min = 0,
                  max = 100,
                  value = c(0,100)
                  )
    ),
    mainPanel("")
  )
)


## Define server logic

server <- function(input, output){


}



## Run the app
shinyApp(ui = ui, server = server)


#+END_SRC

** DONE Lesson 4 : reactive ouput display
CLOSED: [2019-01-28 Mon 10:51]
*** Reactive censusViz task. [[/census-app/][See census-app]]
:PROPERTIES:
:ID:       ee5090b3-e89b-4859-aa1f-25e340b47bf7
:END:

#+BEGIN_SRC R :session *R:shiny-exploration* :tangle census-app/app.R
library("easypackages")
libraries("shiny", "dplyr", "stringr")

## Define UI
ui  <- fluidPage(
  titlePanel("censusViz"),

  sidebarLayout(
    sidebarPanel(
      helpText("Create demographic maps with information form the 2010 US Census"),
      selectInput("inputbox1",
                  h2("Choose variable to display:"),
                  choices = list("Percent White" ,
                                 "Percent Black",
                                 "Percent Hispanic",
                                 "Percent Asian"
                                ),
                  selected = ""
                  ),
      sliderInput("slider1",
                  h2("Range of interest:"),
                  min = 0,
                  max = 100,
                  value = c(0,100)
                  )
    ),
    mainPanel(h1("Reactive Output"),
              textOutput("selected_var"),
              textOutput("slider_range")
              )
  )
)


## Define server logic

server <- function(input, output){

  output$selected_var <- renderText({
    str_glue("Selected option is {input$inputbox1} ")
  })

  output$slider_range <- renderText({
    str_glue("Range selected from \n {input$slider1[1]} to {input$slider1[2]}")
  })
}



## Run the app
shinyApp(ui = ui, server = server)


#+END_SRC

