README.html

<div id="outline-container-orgcb4fb0d" class="outline-4">
<h4 id="orgcb4fb0d"><span class="section-number-4">3.3.2</span> Init censusVis task. <a href="file:///app-04/">See app-04</a></h4>
<div class="outline-text-4" id="text-3-3-2">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #D0372D;">library</span>(shiny)

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define UI</span>
ui  <span style="color: #D0372D;">&lt;-</span> fluidPage(
  titlePanel(<span style="color: #008000;">"censusViz"</span>),

  sidebarLayout(
    sidebarPanel(
      helpText(<span style="color: #008000;">"Create demographic maps with information form the 2010 US Census"</span>),
      selectInput(<span style="color: #008000;">"inputbox1"</span>,
                  h2(<span style="color: #008000;">"Choose variable to display:"</span>),
                  choices = list(<span style="color: #008000;">"Percent White"</span> = 1,
                                 <span style="color: #008000;">"Percent Black"</span> = 2,
                                 <span style="color: #008000;">"Percent Hispanic"</span> = 3,
                                 <span style="color: #008000;">"Percent Asian"</span> = 4
                                 ),
                  selected = <span style="color: #008000;">""</span>
                  ),
      sliderInput(<span style="color: #008000;">"slider1"</span>,
                  h2(<span style="color: #008000;">"Range of interest:"</span>),
                  min = 0,
                  max = 100,
                  value = c(0,100)
                  )
    ),
    mainPanel(<span style="color: #008000;">""</span>)
  )
)


<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define server logic</span>

<span style="color: #006699;">server</span> <span style="color: #D0372D;">&lt;-</span> <span style="color: #0000FF;">function</span>(input, output){


}



<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Run the app</span>
shinyApp(ui = ui, server = server)


</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5a4b8f7" class="outline-3">
<h3 id="org5a4b8f7"><span class="section-number-3">3.4</span> <span class="done DONE">DONE</span> Lesson 4 : reactive ouput display</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-org10eaad4" class="outline-4">
<h4 id="org10eaad4"><span class="section-number-4">3.4.1</span> Reactive censusViz task. <a href="file:///census-app/">See census-app</a></h4>
<div class="outline-text-4" id="text-3-4-1">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #D0372D;">library</span>(<span style="color: #008000;">"easypackages"</span>)
libraries(<span style="color: #008000;">"shiny"</span>, <span style="color: #008000;">"dplyr"</span>, <span style="color: #008000;">"stringr"</span>)

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define UI</span>
ui  <span style="color: #D0372D;">&lt;-</span> fluidPage(
  titlePanel(<span style="color: #008000;">"censusViz"</span>),

  sidebarLayout(
    sidebarPanel(
      helpText(<span style="color: #008000;">"Create demographic maps with information form the 2010 US Census"</span>),
      selectInput(<span style="color: #008000;">"inputbox1"</span>,
                  h2(<span style="color: #008000;">"Choose variable to display:"</span>),
                  choices = list(<span style="color: #008000;">"Percent White"</span> ,
                                 <span style="color: #008000;">"Percent Black"</span>,
                                 <span style="color: #008000;">"Percent Hispanic"</span>,
                                 <span style="color: #008000;">"Percent Asian"</span>
                                ),
                  selected = <span style="color: #008000;">""</span>
                  ),
      sliderInput(<span style="color: #008000;">"slider1"</span>,
                  h2(<span style="color: #008000;">"Range of interest:"</span>),
                  min = 0,
                  max = 100,
                  value = c(0,100)
                  )
    ),
    mainPanel(h1(<span style="color: #008000;">"Reactive Output"</span>),
              textOutput(<span style="color: #008000;">"selected_var"</span>),
              textOutput(<span style="color: #008000;">"slider_range"</span>)
              )
  )
)


<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define server logic</span>

<span style="color: #006699;">server</span> <span style="color: #D0372D;">&lt;-</span> <span style="color: #0000FF;">function</span>(input, output){

  output$selected_var <span style="color: #D0372D;">&lt;-</span> renderText({
    str_glue(<span style="color: #008000;">"Selected option is {input$inputbox1} "</span>)
  })

  output$slider_range <span style="color: #D0372D;">&lt;-</span> renderText({
    str_glue(<span style="color: #008000;">"Range selected from \n {input$slider1[1]} to {input$slider1[2]}"</span>)
  })
}



<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Run the app</span>
shinyApp(ui = ui, server = server)


</pre>
</div>
</div>
</div>
