README.org
*** Test: passing a list to the input choices
:PROPERTIES:
:ID:       D67D0D19-CF30-4157-A98C-BD44B317A69F
:END:

- Note taken on [2019-02-05 Tue 11:04] \\
  Testing to see if a list defined in a variable can be passed as choices. This is possible.

#+BEGIN_SRC R :session *R:shiny-exploration* :tangle census-app/app.R
library("easypackages")
libraries("shiny", "dplyr", "stringr")

## List to pass into the input box choices
test_list = list("Percent White" ,
                 "Percent Black",
                 "Percent Hispanic",
                 "Percent Asian"
                 )
## Define UI
ui  <- fluidPage(
  titlePanel("censusViz"),

  sidebarLayout(
    sidebarPanel(
      helpText("Create demographic maps with information form the 2010 US Census"),
      selectInput("inputbox1",
                  h2("Choose variable to display:"),
                  choices = test_list,
                  selected = ""
                  ),
      sliderInput("slider1",
                  h2("Range of interest:"),
                  min = 0,
                  max = 100,
                  value = c(0,100)
                  )
    ),
    mainPanel(h1("Reactive Output"),
              textOutput("selected_var"),
              textOutput("slider_range")
              )
  )
)


## Define server logic

server <- function(input, output){

  output$selected_var <- renderText({
    str_glue("Selected option is {input$inputbox1} ")
  })

  output$slider_range <- renderText({
    str_glue("Range selected from \n {input$slider1[1]} to {input$slider1[2]}")
  })
}



## Run the app
shinyApp(ui = ui, server = server)


#+END_SRC

** DONE Lesson 5: more complex reactive output
CLOSED: [2019-01-28 Mon 13:30]
*** Testing the helpers.R script for a chloropleth map

#+BEGIN_SRC R :session *R:shiny-exploration*
library(easypackages)
libraries("maps", "mapproj")
source("./census-app-02/01_scripts/helpers.R")
counties  <- read_rds("./census-app-02/00_data/counties.rds")
percent_map(counties$white, "darkgreen", "% White")
#+END_SRC

#+RESULTS:
| 0.21281857787809 | 0.19002668659856 | -0.401840098661777 | 0.520483137251405 | -0.344832092682208 | 0.466189798223245 |
| 0.21281857787809 | 0.19002668659856 | -0.401840098661777 | 0.520483137251405 | -0.344832092682208 | 0.439043128709165 |
| 0.21281857787809 | 0.19002668659856 | -0.401840098661777 | 0.520483137251405 | -0.344832092682208 | 0.411896459195085 |
| 0.21281857787809 | 0.19002668659856 | -0.401840098661777 | 0.520483137251405 | -0.344832092682208 | 0.384749789681005 |
| 0.21281857787809 | 0.19002668659856 | -0.401840098661777 | 0.520483137251405 | -0.344832092682208 | 0.357603120166925 |

