README.html

<div id="outline-container-org19db3be" class="outline-4">
<h4 id="org19db3be"><span class="section-number-4">3.4.2</span> Test: passing a list to the input choices</h4>
<div class="outline-text-4" id="text-3-4-2">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2019-02-05 Tue 11:04] </span></span> <br />
Testing to see if a list defined in a variable can be passed as choices. This is possible.</li>
</ul>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #D0372D;">library</span>(<span style="color: #008000;">"easypackages"</span>)
libraries(<span style="color: #008000;">"shiny"</span>, <span style="color: #008000;">"dplyr"</span>, <span style="color: #008000;">"stringr"</span>)

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">List to pass into the input box choices</span>
test_list = list(<span style="color: #008000;">"Percent White"</span> ,
                 <span style="color: #008000;">"Percent Black"</span>,
                 <span style="color: #008000;">"Percent Hispanic"</span>,
                 <span style="color: #008000;">"Percent Asian"</span>
                 )
<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define UI</span>
ui  <span style="color: #D0372D;">&lt;-</span> fluidPage(
  titlePanel(<span style="color: #008000;">"censusViz"</span>),

  sidebarLayout(
    sidebarPanel(
      helpText(<span style="color: #008000;">"Create demographic maps with information form the 2010 US Census"</span>),
      selectInput(<span style="color: #008000;">"inputbox1"</span>,
                  h2(<span style="color: #008000;">"Choose variable to display:"</span>),
                  choices = test_list,
                  selected = <span style="color: #008000;">""</span>
                  ),
      sliderInput(<span style="color: #008000;">"slider1"</span>,
                  h2(<span style="color: #008000;">"Range of interest:"</span>),
                  min = 0,
                  max = 100,
                  value = c(0,100)
                  )
    ),
    mainPanel(h1(<span style="color: #008000;">"Reactive Output"</span>),
              textOutput(<span style="color: #008000;">"selected_var"</span>),
              textOutput(<span style="color: #008000;">"slider_range"</span>)
              )
  )
)


<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define server logic</span>

<span style="color: #006699;">server</span> <span style="color: #D0372D;">&lt;-</span> <span style="color: #0000FF;">function</span>(input, output){

  output$selected_var <span style="color: #D0372D;">&lt;-</span> renderText({
    str_glue(<span style="color: #008000;">"Selected option is {input$inputbox1} "</span>)
  })

  output$slider_range <span style="color: #D0372D;">&lt;-</span> renderText({
    str_glue(<span style="color: #008000;">"Range selected from \n {input$slider1[1]} to {input$slider1[2]}"</span>)
  })
}



<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Run the app</span>
shinyApp(ui = ui, server = server)


</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf5b156a" class="outline-3">
<h3 id="orgf5b156a"><span class="section-number-3">3.5</span> <span class="done DONE">DONE</span> Lesson 5: more complex reactive output</h3>
<div class="outline-text-3" id="text-3-5">
</div>
<div id="outline-container-orge5695c8" class="outline-4">
<h4 id="orge5695c8"><span class="section-number-4">3.5.1</span> Testing the helpers.R script for a chloropleth map</h4>
<div class="outline-text-4" id="text-3-5-1">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #D0372D;">library</span>(easypackages)
libraries(<span style="color: #008000;">"maps"</span>, <span style="color: #008000;">"mapproj"</span>)
<span style="color: #D0372D;">source</span>(<span style="color: #008000;">"./census-app-02/01_scripts/helpers.R"</span>)
counties  <span style="color: #D0372D;">&lt;-</span> read_rds(<span style="color: #008000;">"./census-app-02/00_data/counties.rds"</span>)
percent_map(counties$white, <span style="color: #008000;">"darkgreen"</span>, <span style="color: #008000;">"% White"</span>)
</pre>
</div>
</div>
</div>
