README.md

    ## Define UI
    ui  <- fluidPage(
      titlePanel("censusViz"),

      sidebarLayout(
        sidebarPanel(
          helpText("Create demographic maps with information form the 2010 US Census"),
          selectInput("inputbox1",
                      h2("Choose variable to display:"),
                      choices = list("Percent White" ,
                                     "Percent Black",
                                     "Percent Hispanic",
                                     "Percent Asian"
                                    ),
                      selected = ""
                      ),
          sliderInput("slider1",
                      h2("Range of interest:"),
                      min = 0,
                      max = 100,
                      value = c(0,100)
                      )
        ),
        mainPanel(h1("Reactive Output"),
                  textOutput("selected_var"),
                  textOutput("slider_range")
                  )
      )
    )


    ## Define server logic

    server <- function(input, output){

      output$selected_var <- renderText({
        str_glue("Selected option is {input$inputbox1} ")
      })

      output$slider_range <- renderText({
        str_glue("Range selected from \n {input$slider1[1]} to {input$slider1[2]}")
      })
    }



    ## Run the app
    shinyApp(ui = ui, server = server)


<a id="orge7ec75f"></a>

### Test: passing a list to the input choices

-   Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2019-02-05 Tue 11:04] </span></span>
    Testing to see if a list defined in a variable can be passed as choices. This is possible.

    library("easypackages")
    libraries("shiny", "dplyr", "stringr")

    ## List to pass into the input box choices
    test_list = list("Percent White" ,
                     "Percent Black",
                     "Percent Hispanic",
                     "Percent Asian"
                     )
    ## Define UI
    ui  <- fluidPage(
      titlePanel("censusViz"),

      sidebarLayout(
        sidebarPanel(
          helpText("Create demographic maps with information form the 2010 US Census"),
          selectInput("inputbox1",
                      h2("Choose variable to display:"),
                      choices = test_list,
                      selected = ""
                      ),
          sliderInput("slider1",
                      h2("Range of interest:"),
                      min = 0,
                      max = 100,
                      value = c(0,100)
                      )
        ),
        mainPanel(h1("Reactive Output"),
                  textOutput("selected_var"),
                  textOutput("slider_range")
                  )
      )
    )


    ## Define server logic

    server <- function(input, output){

      output$selected_var <- renderText({
        str_glue("Selected option is {input$inputbox1} ")
      })

      output$slider_range <- renderText({
        str_glue("Range selected from \n {input$slider1[1]} to {input$slider1[2]}")
      })
    }



    ## Run the app
    shinyApp(ui = ui, server = server)


<a id="org80f8b69"></a>

## DONE Lesson 5: more complex reactive output


<a id="org024cd27"></a>

### Testing the helpers.R script for a chloropleth map

    library(easypackages)
    libraries("maps", "mapproj")
    source("./census-app-02/01_scripts/helpers.R")
    counties  <- read_rds("./census-app-02/00_data/counties.rds")
    percent_map(counties$white, "darkgreen", "% White")
