README.org
*** Setting up chloropleth output in shiny app
:PROPERTIES:
:ID:       1FA6CA17-DE9A-475B-A0DD-8F6457A3A434
:END:
Using the dataset =counties.rds= collected with the =Uscensus2010= R package. [[http://shiny.rstudio.com/tutorial/written-tutorial/lesson5/census-app/data/counties.rds][Download link]].

#+BEGIN_SRC R :session *R:shiny-exploration* :tangle census-app-02/app.R
library("easypackages")
libraries("shiny", "dplyr", "stringr", "readr", "maps", "mapproj")


## Reading the counties dataset and glimpsing
source("helpers.R")
counties <- read_rds("./00_data/counties.rds")
counties %>% glimpse()

## Define UI
ui  <- fluidPage(
  titlePanel("censusViz"),

  sidebarLayout(
    sidebarPanel(
      helpText("Create demographic maps with information form the 2010 US Census"),
      selectInput("inputbox1",
                  h2("Choose variable to display:"),
                  choices = list("Percent White" ,
                                 "Percent Black",
                                 "Percent Hispanic",
                                 "Percent Asian"
                                ),
                  selected = ""
                  ),
      sliderInput("slider1",
                  h2("Range of interest:"),
                  min = 0,
                  max = 100,
                  value = c(0,100)
                  )
    ),
    mainPanel(h1("Reactive Output"),
              textOutput("selected_var"),
              textOutput("slider_range"),
              plotOutput("map")
              )
  )
)

## Define server logic
server <- function(input, output){

  output$selected_var <- renderText({
    str_glue("Selected option is {input$inputbox1} ")
  })

  output$slider_range <- renderText({
    str_glue("Range selected from \n {input$slider1[1]} to {input$slider1[2]}")
  })

  output$map  <- renderPlot({

    arg_list  <-  switch(input$inputbox1,
                         "Percent White" = list(counties$white, "darkgreen","% White population"),
                         "Percent Black" = list(counties$black, "black","% Black population"),
                         "Percent Asian" = list(counties$asian, "darkorange","% Asian population"),
                         "Percent Hispanic" = list(counties$hispanic, "pink","% Hispanic population"),
                         )

    arg_list$max = input$slider1[2]
    arg_list$min = input$slider1[1]

    do.call(percent_map,arg_list)

  })
}



## Run the app
shinyApp(ui = ui, server = server)


#+END_SRC

** TODO Lesson 6: stockVis app

* Recreating in-built Shiny examples [2/3]
:PROPERTIES:
:CREATED:  <2019-01-29 Tue 07:19>
:END:
** DONE Eg 1 Hello Shiny. [[/hello-shiny/][See hello-shiny]]
CLOSED: [2019-02-05 Tue 12:14]
:PROPERTIES:
:ID:       23E27D04-B45B-440D-A4AE-7ADEA48EA250
:END:

#+BEGIN_SRC R :session *R:shiny-exploration* :tangle ./hello-shiny/app.R
library(shiny)

## Define UI
ui  <- fluidPage(
  titlePanel("Hello Shiny"),

  sidebarLayout(
    sidebarPanel(
      sliderInput("slider1",
                  label = "Number of Bins",
                  min = 1,
                  max = 50,
                  value = 20
                  )
    ),
      mainPanel("",
                plotOutput("histplot")
                )
  )
)


## Define server logic

server <- function(input, output){

  output$histplot <- renderPlot({

    dataset <- faithful$waiting
    bins <- seq(min(dataset), max(dataset), length.out = input$slider1 +1)

    hist(dataset, breaks = bins, col = "blue", border = "white",
         xlab = "Waiting time to next eruption(mins)",
         main = "Histogram of waiting times"
         )
  })

}

## Run the app
shinyApp(ui = ui, server = server)
#+END_SRC

