README.html

<div id="outline-container-orgb11a4c3" class="outline-4">
<h4 id="orgb11a4c3"><span class="section-number-4">3.5.2</span> Setting up chloropleth output in shiny app</h4>
<div class="outline-text-4" id="text-3-5-2">
<p>
Using the dataset <code>counties.rds</code> collected with the <code>Uscensus2010</code> R package. <a href="http://shiny.rstudio.com/tutorial/written-tutorial/lesson5/census-app/data/counties.rds">Download link</a>.
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #D0372D;">library</span>(<span style="color: #008000;">"easypackages"</span>)
libraries(<span style="color: #008000;">"shiny"</span>, <span style="color: #008000;">"dplyr"</span>, <span style="color: #008000;">"stringr"</span>, <span style="color: #008000;">"readr"</span>, <span style="color: #008000;">"maps"</span>, <span style="color: #008000;">"mapproj"</span>)


<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Reading the counties dataset and glimpsing</span>
<span style="color: #D0372D;">source</span>(<span style="color: #008000;">"helpers.R"</span>)
counties <span style="color: #D0372D;">&lt;-</span> read_rds(<span style="color: #008000;">"./00_data/counties.rds"</span>)
counties <span style="color: #D0372D;">%&gt;%</span> glimpse()

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define UI</span>
ui  <span style="color: #D0372D;">&lt;-</span> fluidPage(
  titlePanel(<span style="color: #008000;">"censusViz"</span>),

  sidebarLayout(
    sidebarPanel(
      helpText(<span style="color: #008000;">"Create demographic maps with information form the 2010 US Census"</span>),
      selectInput(<span style="color: #008000;">"inputbox1"</span>,
                  h2(<span style="color: #008000;">"Choose variable to display:"</span>),
                  choices = list(<span style="color: #008000;">"Percent White"</span> ,
                                 <span style="color: #008000;">"Percent Black"</span>,
                                 <span style="color: #008000;">"Percent Hispanic"</span>,
                                 <span style="color: #008000;">"Percent Asian"</span>
                                ),
                  selected = <span style="color: #008000;">""</span>
                  ),
      sliderInput(<span style="color: #008000;">"slider1"</span>,
                  h2(<span style="color: #008000;">"Range of interest:"</span>),
                  min = 0,
                  max = 100,
                  value = c(0,100)
                  )
    ),
    mainPanel(h1(<span style="color: #008000;">"Reactive Output"</span>),
              textOutput(<span style="color: #008000;">"selected_var"</span>),
              textOutput(<span style="color: #008000;">"slider_range"</span>),
              plotOutput(<span style="color: #008000;">"map"</span>)
              )
  )
)

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define server logic</span>
<span style="color: #006699;">server</span> <span style="color: #D0372D;">&lt;-</span> <span style="color: #0000FF;">function</span>(input, output){

  output$selected_var <span style="color: #D0372D;">&lt;-</span> renderText({
    str_glue(<span style="color: #008000;">"Selected option is {input$inputbox1} "</span>)
  })

  output$slider_range <span style="color: #D0372D;">&lt;-</span> renderText({
    str_glue(<span style="color: #008000;">"Range selected from \n {input$slider1[1]} to {input$slider1[2]}"</span>)
  })

  output$map  <span style="color: #D0372D;">&lt;-</span> renderPlot({

    arg_list  <span style="color: #D0372D;">&lt;-</span>  <span style="color: #0000FF;">switch</span>(input$inputbox1,
                         <span style="color: #008000;">"Percent White"</span> = list(counties$white, <span style="color: #008000;">"darkgreen"</span>,<span style="color: #008000;">"% White population"</span>),
                         <span style="color: #008000;">"Percent Black"</span> = list(counties$black, <span style="color: #008000;">"black"</span>,<span style="color: #008000;">"% Black population"</span>),
                         <span style="color: #008000;">"Percent Asian"</span> = list(counties$asian, <span style="color: #008000;">"darkorange"</span>,<span style="color: #008000;">"% Asian population"</span>),
                         <span style="color: #008000;">"Percent Hispanic"</span> = list(counties$hispanic, <span style="color: #008000;">"pink"</span>,<span style="color: #008000;">"% Hispanic population"</span>),
                         )

    arg_list$max = input$slider1[2]
    arg_list$min = input$slider1[1]

    do.call(percent_map,arg_list)

  })
}



<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Run the app</span>
shinyApp(ui = ui, server = server)


</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6a2d752" class="outline-3">
<h3 id="org6a2d752"><span class="section-number-3">3.6</span> <span class="todo TODO">TODO</span> Lesson 6: stockVis app</h3>
</div>
</div>

<div id="outline-container-org78ae2db" class="outline-2">
<h2 id="org78ae2db"><span class="section-number-2">4</span> Recreating in-built Shiny examples <code>[2/3]</code></h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgddc56e2" class="outline-3">
<h3 id="orgddc56e2"><span class="section-number-3">4.1</span> <span class="done DONE">DONE</span> Eg 1 Hello Shiny. <a href="file:///hello-shiny/">See hello-shiny</a></h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #D0372D;">library</span>(shiny)

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define UI</span>
ui  <span style="color: #D0372D;">&lt;-</span> fluidPage(
  titlePanel(<span style="color: #008000;">"Hello Shiny"</span>),

  sidebarLayout(
    sidebarPanel(
      sliderInput(<span style="color: #008000;">"slider1"</span>,
                  label = <span style="color: #008000;">"Number of Bins"</span>,
                  min = 1,
                  max = 50,
                  value = 20
                  )
    ),
      mainPanel(<span style="color: #008000;">""</span>,
                plotOutput(<span style="color: #008000;">"histplot"</span>)
                )
  )
)


<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define server logic</span>

<span style="color: #006699;">server</span> <span style="color: #D0372D;">&lt;-</span> <span style="color: #0000FF;">function</span>(input, output){

  output$histplot <span style="color: #D0372D;">&lt;-</span> renderPlot({

    dataset <span style="color: #D0372D;">&lt;-</span> faithful$waiting
    bins <span style="color: #D0372D;">&lt;-</span> seq(min(dataset), max(dataset), length.out = input$slider1 +1)

    hist(dataset, breaks = bins, col = <span style="color: #008000;">"blue"</span>, border = <span style="color: #008000;">"white"</span>,
         xlab = <span style="color: #008000;">"Waiting time to next eruption(mins)"</span>,
         main = <span style="color: #008000;">"Histogram of waiting times"</span>
         )
  })

}

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Run the app</span>
shinyApp(ui = ui, server = server)
</pre>
</div>
</div>
</div>
