README.org
** DONE Eg 2 Shiny text. [[/shiny-text-eg2/][See shiny-text-eg2]]
CLOSED: [2019-01-29 Tue 08:21]
:PROPERTIES:
:ID:       6E0E8862-4096-441A-81C0-DFEBF5957F62
:END:

#+BEGIN_SRC R :session *R:shiny-exploration* :tangle ./shiny-text-eg2/app.R
library(shiny)
library(tidyverse)

## Define UI
ui  <- fluidPage(
  titlePanel("Shiny text"),

  sidebarLayout(
    sidebarPanel(
      selectInput("dataset_choice",
                  label = "Choose a dataset",
                  choices = c("rock", "diamonds", "cars"),
                  #value = ""
                  ),
      numericInput("observation_number",
                   label = "Choose number of observations to display",
                   value = 10
                   )
    ),
    mainPanel(

      verbatimTextOutput("summary"),

      tableOutput("view")
    )
  )
)


## Define server logic

server <- function(input, output){

  datasetInput <- reactive({
    switch(input$dataset_choice,
           "rock" = rock,
           "diamonds"  = diamonds,
           "cars"   = cars
           )
  })

  output$summary <- renderPrint({
    datasetInput() %>% summary()
  })

  output$view <- renderTable({
    datasetInput() %>% head(n = input$observation_number)
  })
}



## Run the app
shinyApp(ui = ui, server = server)
#+END_SRC
*** DONE Base Example

** TODO Eg 6 - tabsets. [[/tabsets-eg-6/][See tabsets-eg-6]]
:PROPERTIES:
:ID:       BD21A308-00FB-4E3B-B1D9-4B44DA6BBB39
:END:

#+BEGIN_SRC R :session *R:shiny-exploration* :tangle ./tabsets-eg-6/app.R
library(shiny)
library(shinythemes)

## Define UI
ui  <- fluidPage(
  themeSelector(),
  titlePanel("Using tabsets"),

  sidebarLayout(
    sidebarPanel(
      radioButtons("dist_type",
                   "Distribution type",
                   choices = c("Normal" = "norm",
                               "Uniform" = "unif",
                               "Log-normal" = "lnorm",
                               "Exponential" = "exp"
                               )
                   ),
      sliderInput("slider1",
                  label = "Number of observations",
                  min = 1,
                  max = 1000,
                  value = 500
                  )
    ),

    mainPanel(

      tabsetPanel(type = "tabs",
                  tabPanel(title = "Plot", plotOutput("plot1")),
                  tabPanel(title = "Summary", verbatimTextOutput("vbto1_summary")),
                  tabPanel(title = "Table", tableOutput("tabl1"))
                  )
    )
  )
)


## Define server logic

server <- function(input, output){
  d <- reactive({
    dist <- switch(input$dist_type,
           norm = rnorm,
           unif = runif,
           lnorm = rlnorm,
           exp = exp
#           rnorm
           )

    dist(input$slider1)
  })

  output$plot1 <- renderPlot({
    dist <- input$dist_type
    n <- input$slider1

    hist(d(),
         main = paste("r", dist, "(", n, ")", sep = ""),
         col = "blue", border = "white")
  })

  output$vbto1_summary <- renderText({
    summary(d())
  })

  output$tabl1 <- renderTable({
    d()
  })
}

## Run the app
shinyApp(ui = ui, server = server)

#+END_SRC

* Dataset exploration app [0/1]
** Switching to dashboard library
*** Loading libraries
:PROPERTIES:
:ID:       A239437B-4196-4E38-9EB6-32989678AD1A
:END:
#+BEGIN_SRC R :tangle ./dataset-explorer/ds/app.R :session *R:shiny-exploration*
# Loading Libraries
library("easypackages")
libraries("tidyverse", "tidyquant", "readxl", "shiny", "shinydashboard", "ISLR", "MASS")
#+END_SRC

#+RESULTS:

*** UI
**** header
:PROPERTIES:
:ID:       22AFAA49-31D3-41F0-AB8C-22F19E656AD4
:END:
#+BEGIN_SRC R :session *R:shiny-exploration* :tangle ./dataset-explorer/ds/app.R
header <- dashboardHeader(title= "R Data set explorer")
#+END_SRC

#+RESULTS:

