README.html

<div id="outline-container-orgba1e538" class="outline-3">
<h3 id="orgba1e538"><span class="section-number-3">4.2</span> <span class="done DONE">DONE</span> Eg 2 Shiny text. <a href="file:///shiny-text-eg2/">See shiny-text-eg2</a></h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #D0372D;">library</span>(shiny)
<span style="color: #D0372D;">library</span>(tidyverse)

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define UI</span>
ui  <span style="color: #D0372D;">&lt;-</span> fluidPage(
  titlePanel(<span style="color: #008000;">"Shiny text"</span>),

  sidebarLayout(
    sidebarPanel(
      selectInput(<span style="color: #008000;">"dataset_choice"</span>,
                  label = <span style="color: #008000;">"Choose a dataset"</span>,
                  choices = c(<span style="color: #008000;">"rock"</span>, <span style="color: #008000;">"diamonds"</span>, <span style="color: #008000;">"cars"</span>),
                  <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">value = ""</span>
                  ),
      numericInput(<span style="color: #008000;">"observation_number"</span>,
                   label = <span style="color: #008000;">"Choose number of observations to display"</span>,
                   value = 10
                   )
    ),
    mainPanel(

      verbatimTextOutput(<span style="color: #008000;">"summary"</span>),

      tableOutput(<span style="color: #008000;">"view"</span>)
    )
  )
)


<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define server logic</span>

<span style="color: #006699;">server</span> <span style="color: #D0372D;">&lt;-</span> <span style="color: #0000FF;">function</span>(input, output){

  datasetInput <span style="color: #D0372D;">&lt;-</span> reactive({
    <span style="color: #0000FF;">switch</span>(input$dataset_choice,
           <span style="color: #008000;">"rock"</span> = rock,
           <span style="color: #008000;">"diamonds"</span>  = diamonds,
           <span style="color: #008000;">"cars"</span>   = cars
           )
  })

  output$summary <span style="color: #D0372D;">&lt;-</span> renderPrint({
    datasetInput() <span style="color: #D0372D;">%&gt;%</span> summary()
  })

  output$view <span style="color: #D0372D;">&lt;-</span> renderTable({
    datasetInput() <span style="color: #D0372D;">%&gt;%</span> head(n = input$observation_number)
  })
}



<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Run the app</span>
shinyApp(ui = ui, server = server)
</pre>
</div>
</div>
<div id="outline-container-org7e04014" class="outline-4">
<h4 id="org7e04014"><span class="section-number-4">4.2.1</span> <span class="done DONE">DONE</span> Base Example</h4>
</div>
</div>

<div id="outline-container-orgfb790f0" class="outline-3">
<h3 id="orgfb790f0"><span class="section-number-3">4.3</span> <span class="todo TODO">TODO</span> Eg 6 - tabsets. <a href="file:///tabsets-eg-6/">See tabsets-eg-6</a></h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #D0372D;">library</span>(shiny)
<span style="color: #D0372D;">library</span>(shinythemes)

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define UI</span>
ui  <span style="color: #D0372D;">&lt;-</span> fluidPage(
  themeSelector(),
  titlePanel(<span style="color: #008000;">"Using tabsets"</span>),

  sidebarLayout(
    sidebarPanel(
      radioButtons(<span style="color: #008000;">"dist_type"</span>,
                   <span style="color: #008000;">"Distribution type"</span>,
                   choices = c(<span style="color: #008000;">"Normal"</span> = <span style="color: #008000;">"norm"</span>,
                               <span style="color: #008000;">"Uniform"</span> = <span style="color: #008000;">"unif"</span>,
                               <span style="color: #008000;">"Log-normal"</span> = <span style="color: #008000;">"lnorm"</span>,
                               <span style="color: #008000;">"Exponential"</span> = <span style="color: #008000;">"exp"</span>
                               )
                   ),
      sliderInput(<span style="color: #008000;">"slider1"</span>,
                  label = <span style="color: #008000;">"Number of observations"</span>,
                  min = 1,
                  max = 1000,
                  value = 500
                  )
    ),

    mainPanel(

      tabsetPanel(type = <span style="color: #008000;">"tabs"</span>,
                  tabPanel(title = <span style="color: #008000;">"Plot"</span>, plotOutput(<span style="color: #008000;">"plot1"</span>)),
                  tabPanel(title = <span style="color: #008000;">"Summary"</span>, verbatimTextOutput(<span style="color: #008000;">"vbto1_summary"</span>)),
                  tabPanel(title = <span style="color: #008000;">"Table"</span>, tableOutput(<span style="color: #008000;">"tabl1"</span>))
                  )
    )
  )
)


<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define server logic</span>

<span style="color: #006699;">server</span> <span style="color: #D0372D;">&lt;-</span> <span style="color: #0000FF;">function</span>(input, output){
  d <span style="color: #D0372D;">&lt;-</span> reactive({
    dist <span style="color: #D0372D;">&lt;-</span> <span style="color: #0000FF;">switch</span>(input$dist_type,
           norm = rnorm,
           unif = runif,
           lnorm = rlnorm,
           exp = exp
<span style="color: #8D8D84;">#           </span><span style="color: #8D8D84; font-style: italic;">rnorm</span>
           )

    dist(input$slider1)
  })

  output$plot1 <span style="color: #D0372D;">&lt;-</span> renderPlot({
    dist <span style="color: #D0372D;">&lt;-</span> input$dist_type
    n <span style="color: #D0372D;">&lt;-</span> input$slider1

    hist(d(),
         main = paste(<span style="color: #008000;">"r"</span>, dist, <span style="color: #008000;">"("</span>, n, <span style="color: #008000;">")"</span>, sep = <span style="color: #008000;">""</span>),
         col = <span style="color: #008000;">"blue"</span>, border = <span style="color: #008000;">"white"</span>)
  })

  output$vbto1_summary <span style="color: #D0372D;">&lt;-</span> renderText({
    summary(d())
  })

  output$tabl1 <span style="color: #D0372D;">&lt;-</span> renderTable({
    d()
  })
}

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Run the app</span>
shinyApp(ui = ui, server = server)

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org68a8529" class="outline-2">
<h2 id="org68a8529"><span class="section-number-2">5</span> Dataset exploration app <code>[0/1]</code></h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org0978d37" class="outline-3">
<h3 id="org0978d37"><span class="section-number-3">5.1</span> Switching to dashboard library</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-orgbd0713d" class="outline-4">
<h4 id="orgbd0713d"><span class="section-number-4">5.1.1</span> Loading libraries</h4>
<div class="outline-text-4" id="text-5-1-1">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Loading Libraries</span>
<span style="color: #D0372D;">library</span>(<span style="color: #008000;">"easypackages"</span>)
libraries(<span style="color: #008000;">"tidyverse"</span>, <span style="color: #008000;">"tidyquant"</span>, <span style="color: #008000;">"readxl"</span>, <span style="color: #008000;">"shiny"</span>, <span style="color: #008000;">"shinydashboard"</span>, <span style="color: #008000;">"ISLR"</span>, <span style="color: #008000;">"MASS"</span>)
</pre>
</div>
</div>
</div>
