README.md

    ## Run the app
    shinyApp(ui = ui, server = server)


<a id="orgf1d7c25"></a>

## DONE Eg 2 Shiny text. [See shiny-text-eg2](file:///shiny-text-eg2/)

    library(shiny)
    library(tidyverse)

    ## Define UI
    ui  <- fluidPage(
      titlePanel("Shiny text"),

      sidebarLayout(
        sidebarPanel(
          selectInput("dataset_choice",
                      label = "Choose a dataset",
                      choices = c("rock", "diamonds", "cars"),
                      #value = ""
                      ),
          numericInput("observation_number",
                       label = "Choose number of observations to display",
                       value = 10
                       )
        ),
        mainPanel(

          verbatimTextOutput("summary"),

          tableOutput("view")
        )
      )
    )


    ## Define server logic

    server <- function(input, output){

      datasetInput <- reactive({
        switch(input$dataset_choice,
               "rock" = rock,
               "diamonds"  = diamonds,
               "cars"   = cars
               )
      })

      output$summary <- renderPrint({
        datasetInput() %>% summary()
      })

      output$view <- renderTable({
        datasetInput() %>% head(n = input$observation_number)
      })
    }



    ## Run the app
    shinyApp(ui = ui, server = server)


<a id="org830c5a6"></a>

### DONE Base Example


<a id="orgd09f70d"></a>

## TODO Eg 6 - tabsets. [See tabsets-eg-6](file:///tabsets-eg-6/)

    library(shiny)
    library(shinythemes)

    ## Define UI
    ui  <- fluidPage(
      themeSelector(),
      titlePanel("Using tabsets"),

      sidebarLayout(
        sidebarPanel(
          radioButtons("dist_type",
                       "Distribution type",
                       choices = c("Normal" = "norm",
                                   "Uniform" = "unif",
                                   "Log-normal" = "lnorm",
                                   "Exponential" = "exp"
                                   )
                       ),
          sliderInput("slider1",
                      label = "Number of observations",
                      min = 1,
                      max = 1000,
                      value = 500
                      )
        ),

        mainPanel(

          tabsetPanel(type = "tabs",
                      tabPanel(title = "Plot", plotOutput("plot1")),
                      tabPanel(title = "Summary", verbatimTextOutput("vbto1_summary")),
                      tabPanel(title = "Table", tableOutput("tabl1"))
                      )
        )
      )
    )


    ## Define server logic

    server <- function(input, output){
      d <- reactive({
        dist <- switch(input$dist_type,
               norm = rnorm,
               unif = runif,
               lnorm = rlnorm,
               exp = exp
    #           rnorm
               )

        dist(input$slider1)
      })

      output$plot1 <- renderPlot({
        dist <- input$dist_type
        n <- input$slider1

        hist(d(),
             main = paste("r", dist, "(", n, ")", sep = ""),
             col = "blue", border = "white")
      })

      output$vbto1_summary <- renderText({
        summary(d())
      })

      output$tabl1 <- renderTable({
        d()
      })
    }

    ## Run the app
    shinyApp(ui = ui, server = server)


<a id="orge4fcdd4"></a>

# Dataset exploration app <code>[0/1]</code>


<a id="orga299dd0"></a>

## Switching to dashboard library


<a id="orgfa98ea4"></a>

### Loading libraries

    # Loading Libraries
    library("easypackages")
    libraries("tidyverse", "tidyquant", "readxl", "shiny", "shinydashboard", "ISLR", "MASS")
