README.org
**** sidebar
:PROPERTIES:
:ID:       EC86BD50-D3CB-42AE-A6E7-4C6B70F1F1A5
:END:
#+BEGIN_SRC R  :tangle ./dataset-explorer/ds/app.R :session *R:shiny-exploration*
sidebar <- dashboardSidebar(
    sidebarMenu(
      menuItem("In-built data sets",
               tabName = "inbuilt_datasets",
               icon = icon("dashboard")
               ),
      menuItem("Rdatasets",
               tabName = "rdatasets",
               icon = icon("dashboard")
               )
    )
)
#+END_SRC

#+RESULTS:

**** body
:PROPERTIES:
:ID:       B5C91572-8382-45DC-92C6-28BF69EB95BC
:END:
#+BEGIN_SRC  R :tangle ./dataset-explorer/ds/app.R :session *R:shiny-exploration*
body <- dashboardBody(
  tabItems(
    tabItem(
      tabName = "inbuilt_datasets",
      fluidRow(

        box(title = "Input",
            selectInput("dataset",
                        label = "Select Dataset",
                        choices = c(ls("package:datasets") ,
                                    data(package = "MASS")$results %>% as.tibble %>% .$Title
                                    )
                        )
           ),

        box(title = "Summary",
            verbatimTextOutput("summary"),
            fluidRow(
              box(
                title = "Data Glimpse",
                verbatimTextOutput("glimpse")
              )
            )
        )
      )
      )
     ),
  tabItem(
    tabName = "rdatasets",
    h2("Rdatasets"),
    fluidRow(

      box(title = "Input",
          selectInput("rdataset",
                      label = "Select from RDatasets",
                      choices = data(package = "MASS")$results %>% as.tibble %>% .$Title
                        ),

      box(title = "Summary",
            verbatimTextOutput("summary_rdatasets"),
            fluidRow(
              box(
            title = "Data Glimpse"),
          verbatimTextOutput("glimpse_rdatasets")
          )
          )
    )
  )
  )
)
#+END_SRC

#+RESULTS:

**** Assigning UI
:PROPERTIES:
:ID:       165061AC-1BCA-4199-9751-F83DBE3A2A64
:END:
#+BEGIN_SRC R :session *R:shiny-exploration* :tangle ./dataset-explorer/ds/app.R
ui  <- dashboardPage(header, sidebar, body)
#+END_SRC

#+RESULTS:

*** Server
:PROPERTIES:
:ID:       326AB9C9-8310-4B0C-BA39-3424A3006545
:END:

#+BEGIN_SRC R :session *R:shiny-exploration* :tangle ./dataset-explorer/ds/app.R
## Define server logic

server <- function(input, output){

  output$summary = renderPrint({
    dataset <- get(input$dataset, "package:datasets", inherits = FALSE)
    summary(dataset)
  })

  ## output$table = renderTable({
  ##   dataset <- get(input$dataset, "package:datasets", inherits = FALSE)
  ##   dataset
  ## })

  output$glimpse = renderPrint({
    dataset <- get(input$dataset, "package:datasets", inherits = FALSE)
    glimpse(dataset)
  })

}
#+END_SRC

#+RESULTS:

*** App
:PROPERTIES:
:ID:       5E285D47-8A5E-4877-95D1-6FEB83ECABE4
:END:

#+BEGIN_SRC R :session *R:shiny-exploration* :tangle ./dataset-explorer/ds/app.R
## Run the app
shinyApp(ui = ui, server = server)
#+END_SRC

