README.html

<div id="outline-container-org8a528cc" class="outline-4">
<h4 id="org8a528cc"><span class="section-number-4">5.1.2</span> UI</h4>
<div class="outline-text-4" id="text-5-1-2">
</div>
<ol class="org-ol">
<li><a id="org02a1a63"></a>header<br />
<div class="outline-text-5" id="text-5-1-2-1">
<div class="org-src-container">
<pre class="src src-R">header <span style="color: #D0372D;">&lt;-</span> dashboardHeader(title= <span style="color: #008000;">"R Data set explorer"</span>)
</pre>
</div>
</div>
</li>

<li><a id="org139d71e"></a>sidebar<br />
<div class="outline-text-5" id="text-5-1-2-2">
<div class="org-src-container">
<pre class="src src-R">sidebar <span style="color: #D0372D;">&lt;-</span> dashboardSidebar(
    sidebarMenu(
      menuItem(<span style="color: #008000;">"In-built data sets"</span>,
               tabName = <span style="color: #008000;">"inbuilt_datasets"</span>,
               icon = icon(<span style="color: #008000;">"dashboard"</span>)
               ),
      menuItem(<span style="color: #008000;">"Rdatasets"</span>,
               tabName = <span style="color: #008000;">"rdatasets"</span>,
               icon = icon(<span style="color: #008000;">"dashboard"</span>)
               )
    )
)
</pre>
</div>
</div>
</li>

<li><a id="org969e148"></a>body<br />
<div class="outline-text-5" id="text-5-1-2-3">
<div class="org-src-container">
<pre class="src src-R">body <span style="color: #D0372D;">&lt;-</span> dashboardBody(
  tabItems(
    tabItem(
      tabName = <span style="color: #008000;">"inbuilt_datasets"</span>,
      fluidRow(

        box(title = <span style="color: #008000;">"Input"</span>,
            selectInput(<span style="color: #008000;">"dataset"</span>,
                        label = <span style="color: #008000;">"Select Dataset"</span>,
                        choices = c(ls(<span style="color: #008000;">"package:datasets"</span>) ,
                                    data(package = <span style="color: #008000;">"MASS"</span>)$results <span style="color: #D0372D;">%&gt;%</span> as.tibble <span style="color: #D0372D;">%&gt;%</span> .$Title
                                    )
                        )
           ),

        box(title = <span style="color: #008000;">"Summary"</span>,
            verbatimTextOutput(<span style="color: #008000;">"summary"</span>),
            fluidRow(
              box(
                title = <span style="color: #008000;">"Data Glimpse"</span>,
                verbatimTextOutput(<span style="color: #008000;">"glimpse"</span>)
              )
            )
        )
      )
      )
     ),
  tabItem(
    tabName = <span style="color: #008000;">"rdatasets"</span>,
    h2(<span style="color: #008000;">"Rdatasets"</span>),
    fluidRow(

      box(title = <span style="color: #008000;">"Input"</span>,
          selectInput(<span style="color: #008000;">"rdataset"</span>,
                      label = <span style="color: #008000;">"Select from RDatasets"</span>,
                      choices = data(package = <span style="color: #008000;">"MASS"</span>)$results <span style="color: #D0372D;">%&gt;%</span> as.tibble <span style="color: #D0372D;">%&gt;%</span> .$Title
                        ),

      box(title = <span style="color: #008000;">"Summary"</span>,
            verbatimTextOutput(<span style="color: #008000;">"summary_rdatasets"</span>),
            fluidRow(
              box(
            title = <span style="color: #008000;">"Data Glimpse"</span>),
          verbatimTextOutput(<span style="color: #008000;">"glimpse_rdatasets"</span>)
          )
          )
    )
  )
  )
)
</pre>
</div>
</div>
</li>
