README.md


<a id="org94df20f"></a>

### UI

1.  header

        header <- dashboardHeader(title= "R Data set explorer")

2.  sidebar

        sidebar <- dashboardSidebar(
            sidebarMenu(
              menuItem("In-built data sets",
                       tabName = "inbuilt_datasets",
                       icon = icon("dashboard")
                       ),
              menuItem("Rdatasets",
                       tabName = "rdatasets",
                       icon = icon("dashboard")
                       )
            )
        )

3.  body

        body <- dashboardBody(
          tabItems(
            tabItem(
              tabName = "inbuilt_datasets",
              fluidRow(

                box(title = "Input",
                    selectInput("dataset",
                                label = "Select Dataset",
                                choices = c(ls("package:datasets") ,
                                            data(package = "MASS")$results %>% as.tibble %>% .$Title
                                            )
                                )
                   ),

                box(title = "Summary",
                    verbatimTextOutput("summary"),
                    fluidRow(
                      box(
                        title = "Data Glimpse",
                        verbatimTextOutput("glimpse")
                      )
                    )
                )
              )
              )
             ),
          tabItem(
            tabName = "rdatasets",
            h2("Rdatasets"),
            fluidRow(

              box(title = "Input",
                  selectInput("rdataset",
                              label = "Select from RDatasets",
                              choices = data(package = "MASS")$results %>% as.tibble %>% .$Title
                                ),

              box(title = "Summary",
                    verbatimTextOutput("summary_rdatasets"),
                    fluidRow(
                      box(
                    title = "Data Glimpse"),
                  verbatimTextOutput("glimpse_rdatasets")
                  )
                  )
            )
          )
          )
        )

4.  Assigning UI

        ui  <- dashboardPage(header, sidebar, body)
