README.org
** Simple Layout - In built R Data Explorer
:PROPERTIES:
:ID:       C4C79F90-C98D-43B2-931F-5FB8B570BDD4
:END:
- Note taken on [2019-02-05 Tue 09:20] \\
  Appears that the sidepanel and mainpanel concepts cannot be used with =fluidRow()= as subcomponents. Instead, it is possible to use only =fluidRow()= to partition the page, and use it to create individual rows within a column. Perhaps this is more flexible in the long run.

#+BEGIN_SRC R :session *R:shiny-exploration* :tangle ./dataset-explorer/app.R
library("easypackages")
libraries("shiny", "tidyverse")

## Define UI
ui  <- fluidPage(
    titlePanel("R's in-built Database explorer"),

  fluidRow(
    column(2,
           "Input",
           selectInput("dataset",
                       label = "Select Dataset",
                       choices = ls("package:datasets")
                       )
           ),
    column(10,
           verbatimTextOutput("summary"),
           fluidRow(
             verbatimTextOutput("glimpse")
                         ))
    )
)

## Define server logic

server <- function(input, output){

  output$summary = renderPrint({
    dataset <- get(input$dataset, "package:datasets", inherits = FALSE)
    summary(dataset)
  })

  output$table = renderTable({
    dataset <- get(input$dataset, "package:datasets", inherits = FALSE)
    dataset
  })

  output$glimpse = renderPrint({
    dataset <- get(input$dataset, "package:datasets", inherits = FALSE)
    glimpse(dataset)
  })

}

## Run the app
shinyApp(ui = ui, server = server)

#+END_SRC

** TODO Shiny app around Rdatasets
*** Introduction
*** Resources and References
1. [[https://stackoverflow.com/questions/33797666/how-do-i-get-a-list-of-built-in-data-sets-in-r][SO Discusion: List of in-built datasets in R]]
***
* Shiny Dashboard init
** References and notes
1. Rstudio documentation, getting started with Shiny Dashboard [[https://rstudio.github.io/shinydashboard/get_started.html][link]]
2. [[https://shiny.rstudio.com/articles/dashboards.html][There are 2 types of packages]] available to create dashboards flexdashboard and shiny dashboard.
** Installing shiny dashboard

#+BEGIN_SRC R :session *R:shiny-exploration*
install.packages("shinydashboard")
#+END_SRC

