README.html

<li><a id="orgbe105ee"></a>Assigning UI<br />
<div class="outline-text-5" id="text-5-1-2-4">
<div class="org-src-container">
<pre class="src src-R">ui  <span style="color: #D0372D;">&lt;-</span> dashboardPage(header, sidebar, body)
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org4ac2fa1" class="outline-4">
<h4 id="org4ac2fa1"><span class="section-number-4">5.1.3</span> Server</h4>
<div class="outline-text-4" id="text-5-1-3">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define server logic</span>

<span style="color: #006699;">server</span> <span style="color: #D0372D;">&lt;-</span> <span style="color: #0000FF;">function</span>(input, output){

  output$summary = renderPrint({
    dataset <span style="color: #D0372D;">&lt;-</span> get(input$dataset, <span style="color: #008000;">"package:datasets"</span>, inherits = <span style="color: #6434A3;">FALSE</span>)
    summary(dataset)
  })

  <span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">output$table = renderTable({</span>
  <span style="color: #8D8D84;">##   </span><span style="color: #8D8D84; font-style: italic;">dataset &lt;- get(input$dataset, "package:datasets", inherits = FALSE)</span>
  <span style="color: #8D8D84;">##   </span><span style="color: #8D8D84; font-style: italic;">dataset</span>
  <span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">})</span>

  output$glimpse = renderPrint({
    dataset <span style="color: #D0372D;">&lt;-</span> get(input$dataset, <span style="color: #008000;">"package:datasets"</span>, inherits = <span style="color: #6434A3;">FALSE</span>)
    glimpse(dataset)
  })

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5d97ee9" class="outline-4">
<h4 id="org5d97ee9"><span class="section-number-4">5.1.4</span> App</h4>
<div class="outline-text-4" id="text-5-1-4">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Run the app</span>
shinyApp(ui = ui, server = server)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org669fe5b" class="outline-3">
<h3 id="org669fe5b"><span class="section-number-3">5.2</span> Simple Layout - In built R Data Explorer</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2019-02-05 Tue 09:20] </span></span> <br />
Appears that the sidepanel and mainpanel concepts cannot be used with <code>fluidRow()</code> as subcomponents. Instead, it is possible to use only <code>fluidRow()</code> to partition the page, and use it to create individual rows within a column. Perhaps this is more flexible in the long run.</li>
</ul>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #D0372D;">library</span>(<span style="color: #008000;">"easypackages"</span>)
libraries(<span style="color: #008000;">"shiny"</span>, <span style="color: #008000;">"tidyverse"</span>)

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define UI</span>
ui  <span style="color: #D0372D;">&lt;-</span> fluidPage(
    titlePanel(<span style="color: #008000;">"R's in-built Database explorer"</span>),

  fluidRow(
    column(2,
           <span style="color: #008000;">"Input"</span>,
           selectInput(<span style="color: #008000;">"dataset"</span>,
                       label = <span style="color: #008000;">"Select Dataset"</span>,
                       choices = ls(<span style="color: #008000;">"package:datasets"</span>)
                       )
           ),
    column(10,
           verbatimTextOutput(<span style="color: #008000;">"summary"</span>),
           fluidRow(
             verbatimTextOutput(<span style="color: #008000;">"glimpse"</span>)
                         ))
    )
)

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define server logic</span>

<span style="color: #006699;">server</span> <span style="color: #D0372D;">&lt;-</span> <span style="color: #0000FF;">function</span>(input, output){

  output$summary = renderPrint({
    dataset <span style="color: #D0372D;">&lt;-</span> get(input$dataset, <span style="color: #008000;">"package:datasets"</span>, inherits = <span style="color: #6434A3;">FALSE</span>)
    summary(dataset)
  })

  output$table = renderTable({
    dataset <span style="color: #D0372D;">&lt;-</span> get(input$dataset, <span style="color: #008000;">"package:datasets"</span>, inherits = <span style="color: #6434A3;">FALSE</span>)
    dataset
  })

  output$glimpse = renderPrint({
    dataset <span style="color: #D0372D;">&lt;-</span> get(input$dataset, <span style="color: #008000;">"package:datasets"</span>, inherits = <span style="color: #6434A3;">FALSE</span>)
    glimpse(dataset)
  })

}

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Run the app</span>
shinyApp(ui = ui, server = server)

</pre>
</div>
</div>
</div>

<div id="outline-container-org1481fe0" class="outline-3">
<h3 id="org1481fe0"><span class="section-number-3">5.3</span> <span class="todo TODO">TODO</span> Shiny app around Rdatasets</h3>
<div class="outline-text-3" id="text-5-3">
</div>
<div id="outline-container-org4bc5d56" class="outline-4">
<h4 id="org4bc5d56"><span class="section-number-4">5.3.1</span> Introduction</h4>
</div>
<div id="outline-container-org75249bf" class="outline-4">
<h4 id="org75249bf"><span class="section-number-4">5.3.2</span> Resources and References</h4>
<div class="outline-text-4" id="text-5-3-2">
<ol class="org-ol">
<li><a href="https://stackoverflow.com/questions/33797666/how-do-i-get-a-list-of-built-in-data-sets-in-r">SO Discusion: List of in-built datasets in R</a></li>
</ol>
<p>
<b>*</b>
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org4eac44f" class="outline-2">
<h2 id="org4eac44f"><span class="section-number-2">6</span> Shiny Dashboard init</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgee0a978" class="outline-3">
<h3 id="orgee0a978"><span class="section-number-3">6.1</span> References and notes</h3>
<div class="outline-text-3" id="text-6-1">
<ol class="org-ol">
<li>Rstudio documentation, getting started with Shiny Dashboard <a href="https://rstudio.github.io/shinydashboard/get_started.html">link</a></li>
<li><a href="https://shiny.rstudio.com/articles/dashboards.html">There are 2 types of packages</a> available to create dashboards flexdashboard and shiny dashboard.</li>
</ol>
</div>
</div>
<div id="outline-container-org4850a38" class="outline-3">
<h3 id="org4850a38"><span class="section-number-3">6.2</span> Installing shiny dashboard</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-R">install.packages(<span style="color: #008000;">"shinydashboard"</span>)
</pre>
</div>
</div>
</div>
