README.md


<a id="org30244cc"></a>

### Server

    ## Define server logic

    server <- function(input, output){

      output$summary = renderPrint({
        dataset <- get(input$dataset, "package:datasets", inherits = FALSE)
        summary(dataset)
      })

      ## output$table = renderTable({
      ##   dataset <- get(input$dataset, "package:datasets", inherits = FALSE)
      ##   dataset
      ## })

      output$glimpse = renderPrint({
        dataset <- get(input$dataset, "package:datasets", inherits = FALSE)
        glimpse(dataset)
      })

    }


<a id="orgdf8561d"></a>

### App

    ## Run the app
    shinyApp(ui = ui, server = server)


<a id="org252641c"></a>

## Simple Layout - In built R Data Explorer

-   Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2019-02-05 Tue 09:20] </span></span>
    Appears that the sidepanel and mainpanel concepts cannot be used with `fluidRow()` as subcomponents. Instead, it is possible to use only `fluidRow()` to partition the page, and use it to create individual rows within a column. Perhaps this is more flexible in the long run.

    library("easypackages")
    libraries("shiny", "tidyverse")

    ## Define UI
    ui  <- fluidPage(
        titlePanel("R's in-built Database explorer"),

      fluidRow(
        column(2,
               "Input",
               selectInput("dataset",
                           label = "Select Dataset",
                           choices = ls("package:datasets")
                           )
               ),
        column(10,
               verbatimTextOutput("summary"),
               fluidRow(
                 verbatimTextOutput("glimpse")
                             ))
        )
    )

    ## Define server logic

    server <- function(input, output){

      output$summary = renderPrint({
        dataset <- get(input$dataset, "package:datasets", inherits = FALSE)
        summary(dataset)
      })

      output$table = renderTable({
        dataset <- get(input$dataset, "package:datasets", inherits = FALSE)
        dataset
      })

      output$glimpse = renderPrint({
        dataset <- get(input$dataset, "package:datasets", inherits = FALSE)
        glimpse(dataset)
      })

    }

    ## Run the app
    shinyApp(ui = ui, server = server)


<a id="orgdcff6ec"></a>

## TODO Shiny app around Rdatasets


<a id="org45690c2"></a>

### Introduction


<a id="org3f185b4"></a>

### Resources and References

1.  [SO Discusion: List of in-built datasets in R](https://stackoverflow.com/questions/33797666/how-do-i-get-a-list-of-built-in-data-sets-in-r)

**\***


<a id="orgbcff2b9"></a>

# Shiny Dashboard init


<a id="org5cc7322"></a>

## References and notes

1.  Rstudio documentation, getting started with Shiny Dashboard [link](https://rstudio.github.io/shinydashboard/get_started.html)
2.  [There are 2 types of packages](https://shiny.rstudio.com/articles/dashboards.html) available to create dashboards flexdashboard and shiny dashboard.


<a id="org029bd6a"></a>

## Installing shiny dashboard

    install.packages("shinydashboard")
