README.org
** Basic app -- Init. [[/dashboard-01/][See dashboard-01]]
:PROPERTIES:
:ID:       1b87facf-ff4e-4246-837b-545fbb0260b1
:END:

#+BEGIN_SRC R :session *R:shiny-exploration* :tangle ./dashboard-01/app.R
library("easypackages")
libraries("shiny","shinydashboard", "tidyverse")

## Define UI
ui  <- dashboardPage(
  ## Inserting the 3 components: header, sidebar, body

  dashboardHeader(title = "Basic Dashboard"),
  dashboardSidebar(
    sidebarMenu(
      menuItem("Dashboard",
               tabName = "dashboard",
               icon = icon("dashboard")),
      menuItem("Widgets",
               tabName = "widgets",
               icon = icon("th")
               )
    )
  ),
  dashboardBody(
    ## Adding a fluidRow with boxes for plot and slider input
    tabItems(
      tabItem(
        tabName = "dashboard",
        fluidRow(

          box(plotOutput(
            "plot1",
            height = 250
          )),

          box(
            title = "Controls",
            sliderInput("slider1",
                        "Number of observations",
                        min = 1,
                        max = 100,
                        value = 50)
          )
        )
      ),

      tabItem(tabName = "widgets",
              h2("Widgets tab")
              )
    )
  )
)

## Define server logic

server <- function(input, output){
  set.seed(120)
  histdata <- rnorm(1000)

  output$plot1 <- renderPlot({
    data <- histdata[seq_len(input$slider1)]
    hist(data)
  })

}

## Run the app
shinyApp(ui = ui, server = server)

#+END_SRC

** Notes on the structure of a dashboard: [[https://rstudio.github.io/shinydashboard/structure.html][Rstudio documentation link]]
*** Main components : header, sidebar, body -> defined for =dashboardPage()=
These can be split up into separate variables and fed into the dashboardPage function. This is useful in the case of complex or long programs.

#+BEGIN_SRC R
header  <- dashboardHeader()  # Defining the content of each function into a variable
sidebar  <- dashboardSiderbar()
body  <- dashboardBody()

dashboardPage(header, sidebar, body)
#+END_SRC

**** Header

This will contain the dropdownMenu() items of different types. The types could  could be messages or notifications etc.

** Experimenting with structures

Incorporating elements from the structures overview in Rstudio's documentation ([[https://rstudio.github.io/shinydashboard/structure.html][link]]).

