README.html

<div id="outline-container-org5acb6f8" class="outline-3">
<h3 id="org5acb6f8"><span class="section-number-3">6.3</span> Basic app &#x2013; Init. <a href="file:///dashboard-01/">See dashboard-01</a></h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #D0372D;">library</span>(<span style="color: #008000;">"easypackages"</span>)
libraries(<span style="color: #008000;">"shiny"</span>,<span style="color: #008000;">"shinydashboard"</span>, <span style="color: #008000;">"tidyverse"</span>)

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define UI</span>
ui  <span style="color: #D0372D;">&lt;-</span> dashboardPage(
  <span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Inserting the 3 components: header, sidebar, body</span>

  dashboardHeader(title = <span style="color: #008000;">"Basic Dashboard"</span>),
  dashboardSidebar(
    sidebarMenu(
      menuItem(<span style="color: #008000;">"Dashboard"</span>,
               tabName = <span style="color: #008000;">"dashboard"</span>,
               icon = icon(<span style="color: #008000;">"dashboard"</span>)),
      menuItem(<span style="color: #008000;">"Widgets"</span>,
               tabName = <span style="color: #008000;">"widgets"</span>,
               icon = icon(<span style="color: #008000;">"th"</span>)
               )
    )
  ),
  dashboardBody(
    <span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Adding a fluidRow with boxes for plot and slider input</span>
    tabItems(
      tabItem(
        tabName = <span style="color: #008000;">"dashboard"</span>,
        fluidRow(

          box(plotOutput(
            <span style="color: #008000;">"plot1"</span>,
            height = 250
          )),

          box(
            title = <span style="color: #008000;">"Controls"</span>,
            sliderInput(<span style="color: #008000;">"slider1"</span>,
                        <span style="color: #008000;">"Number of observations"</span>,
                        min = 1,
                        max = 100,
                        value = 50)
          )
        )
      ),

      tabItem(tabName = <span style="color: #008000;">"widgets"</span>,
              h2(<span style="color: #008000;">"Widgets tab"</span>)
              )
    )
  )
)

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define server logic</span>

<span style="color: #006699;">server</span> <span style="color: #D0372D;">&lt;-</span> <span style="color: #0000FF;">function</span>(input, output){
  set.seed(120)
  histdata <span style="color: #D0372D;">&lt;-</span> rnorm(1000)

  output$plot1 <span style="color: #D0372D;">&lt;-</span> renderPlot({
    data <span style="color: #D0372D;">&lt;-</span> histdata[seq_len(input$slider1)]
    hist(data)
  })

}

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Run the app</span>
shinyApp(ui = ui, server = server)

</pre>
</div>
</div>
</div>

<div id="outline-container-org7891855" class="outline-3">
<h3 id="org7891855"><span class="section-number-3">6.4</span> Notes on the structure of a dashboard: <a href="https://rstudio.github.io/shinydashboard/structure.html">Rstudio documentation link</a></h3>
<div class="outline-text-3" id="text-6-4">
</div>
<div id="outline-container-org349746f" class="outline-4">
<h4 id="org349746f"><span class="section-number-4">6.4.1</span> Main components : header, sidebar, body -&gt; defined for <code>dashboardPage()</code></h4>
<div class="outline-text-4" id="text-6-4-1">
<p>
These can be split up into separate variables and fed into the dashboardPage function. This is useful in the case of complex or long programs.
</p>

<div class="org-src-container">
<pre class="src src-R">header  <span style="color: #D0372D;">&lt;-</span> dashboardHeader()  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Defining the content of each function into a variable</span>
sidebar  <span style="color: #D0372D;">&lt;-</span> dashboardSiderbar()
body  <span style="color: #D0372D;">&lt;-</span> dashboardBody()

dashboardPage(header, sidebar, body)
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orgeffcd5d"></a>Header<br />
<div class="outline-text-5" id="text-6-4-1-1">
<p>
This will contain the dropdownMenu() items of different types. The types could  could be messages or notifications etc.
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org7d9fa29" class="outline-3">
<h3 id="org7d9fa29"><span class="section-number-3">6.5</span> Experimenting with structures</h3>
<div class="outline-text-3" id="text-6-5">
<p>
Incorporating elements from the structures overview in Rstudio's documentation (<a href="https://rstudio.github.io/shinydashboard/structure.html">link</a>).
</p>
</div>
