README.md


<a id="orgce95f3d"></a>

## Basic app &#x2013; Init. [See dashboard-01](file:///dashboard-01/)

    library("easypackages")
    libraries("shiny","shinydashboard", "tidyverse")

    ## Define UI
    ui  <- dashboardPage(
      ## Inserting the 3 components: header, sidebar, body

      dashboardHeader(title = "Basic Dashboard"),
      dashboardSidebar(
        sidebarMenu(
          menuItem("Dashboard",
                   tabName = "dashboard",
                   icon = icon("dashboard")),
          menuItem("Widgets",
                   tabName = "widgets",
                   icon = icon("th")
                   )
        )
      ),
      dashboardBody(
        ## Adding a fluidRow with boxes for plot and slider input
        tabItems(
          tabItem(
            tabName = "dashboard",
            fluidRow(

              box(plotOutput(
                "plot1",
                height = 250
              )),

              box(
                title = "Controls",
                sliderInput("slider1",
                            "Number of observations",
                            min = 1,
                            max = 100,
                            value = 50)
              )
            )
          ),

          tabItem(tabName = "widgets",
                  h2("Widgets tab")
                  )
        )
      )
    )

    ## Define server logic

    server <- function(input, output){
      set.seed(120)
      histdata <- rnorm(1000)

      output$plot1 <- renderPlot({
        data <- histdata[seq_len(input$slider1)]
        hist(data)
      })

    }

    ## Run the app
    shinyApp(ui = ui, server = server)


<a id="orge5400a3"></a>

## Notes on the structure of a dashboard: [Rstudio documentation link](https://rstudio.github.io/shinydashboard/structure.html)


<a id="org5f54b0b"></a>

### Main components : header, sidebar, body -> defined for `dashboardPage()`

These can be split up into separate variables and fed into the dashboardPage function. This is useful in the case of complex or long programs.

    header  <- dashboardHeader()  # Defining the content of each function into a variable
    sidebar  <- dashboardSiderbar()
    body  <- dashboardBody()

    dashboardPage(header, sidebar, body)

1.  Header

    This will contain the dropdownMenu() items of different types. The types could  could be messages or notifications etc.


<a id="orgdcbc01d"></a>

## Experimenting with structures

Incorporating elements from the structures overview in Rstudio's documentation ([link](https://rstudio.github.io/shinydashboard/structure.html)).
