README.html

<div id="outline-container-orgdbc7cd9" class="outline-4">
<h4 id="orgdbc7cd9"><span class="section-number-4">6.5.1</span> Dropdown menu items (static) : messages, tasks, notifications</h4>
<div class="outline-text-4" id="text-6-5-1">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #D0372D;">library</span>(<span style="color: #008000;">"easypackages"</span>)
libraries(<span style="color: #008000;">"shiny"</span>,<span style="color: #008000;">"shinydashboard"</span>, <span style="color: #008000;">"tidyverse"</span>)

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define UI</span>
ui  <span style="color: #D0372D;">&lt;-</span> dashboardPage(
  <span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Inserting the 3 components: header, sidebar, body</span>

  dashboardHeader(title = <span style="color: #008000;">"Basic Dashboard"</span>,
                  <span style="color: #8D8D84;">##</span><span style="color: #8D8D84; font-style: italic;">Experimenting with static dropdown menu message items.</span>
                  dropdownMenu(
                    type = <span style="color: #008000;">"messages"</span>,
                    <span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Message items require a 'from' and 'message' argument</span>
                    messageItem(
                      from = <span style="color: #008000;">"Sales Dept"</span>,
                      message = <span style="color: #008000;">"Sales are steady."</span>
                    ),
                    messageItem(
                      from = <span style="color: #008000;">"Shop Floor"</span>,
                      message = <span style="color: #008000;">"Job XXX is done"</span>
                    )
                  ),
                  <span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Adding static tasks items in dropdown menu</span>
                  dropdownMenu(type = <span style="color: #008000;">"tasks"</span>,
                               taskItem(value = 37,
                                        <span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">The value denotes the percentage completion</span>
                                        color = <span style="color: #008000;">"red"</span>,
                                        <span style="color: #008000;">"Test Project 1"</span>
                                        ),
                               taskItem(value = 50,
                                        color = <span style="color: #008000;">"blue"</span>,
                                        <span style="color: #008000;">"Test Project 2"</span>
                                        )
                               ),

                  dropdownMenu(type = <span style="color: #008000;">"notifications"</span>,
                               notificationItem(
                                 text = <span style="color: #008000;">"Blah Blah Today is cold"</span>,
                                 icon(<span style="color: #008000;">"users"</span>)
                               ),
                               notificationItem(
                                 text = <span style="color: #008000;">"Another notification"</span>,
                                 icon(<span style="color: #008000;">"truck"</span>),
                                 status = <span style="color: #008000;">"success"</span>
                               ),
                               notificationItem(
                                 text = <span style="color: #008000;">"3rd notification"</span>,
                                 icon(<span style="color: #008000;">"exclamation-triangle"</span>),
                                 status = <span style="color: #008000;">"warning"</span>
                               )
                               )
                  ),
  dashboardSidebar(
    sidebarMenu(
      menuItem(<span style="color: #008000;">"Dashboard"</span>,
               tabName = <span style="color: #008000;">"dashboard"</span>,
               icon = icon(<span style="color: #008000;">"dashboard"</span>)),
      menuItem(<span style="color: #008000;">"Widgets"</span>,
               tabName = <span style="color: #008000;">"widgets"</span>,
               icon = icon(<span style="color: #008000;">"th"</span>)
               )
    )
  ),
  dashboardBody(
    <span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Adding a fluidRow with boxes for plot and slider input</span>
    <span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Assigning the tab to the tab names and populating individual content</span>
    tabItems(
      tabItem(
        tabName = <span style="color: #008000;">"dashboard"</span>,
        fluidRow(
          <span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Note that the objects are encapsulated within a box</span>
          box(plotOutput(
            <span style="color: #008000;">"plot1"</span>,
            height = 250
          )),

          box(
            title = <span style="color: #008000;">"Controls"</span>,
            sliderInput(<span style="color: #008000;">"slider1"</span>,
                        <span style="color: #008000;">"Number of observations"</span>,
                        min = 1,
                        max = 100,
                        value = 50)
          )
        )
      ),

      tabItem(tabName = <span style="color: #008000;">"widgets"</span>,
              h2(<span style="color: #008000;">"Widgets tab"</span>)
              )
    )
  )
)

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define server logic</span>

<span style="color: #006699;">server</span> <span style="color: #D0372D;">&lt;-</span> <span style="color: #0000FF;">function</span>(input, output){
  set.seed(120)
  histdata <span style="color: #D0372D;">&lt;-</span> rnorm(1000)

  output$plot1 <span style="color: #D0372D;">&lt;-</span> renderPlot({
    data <span style="color: #D0372D;">&lt;-</span> histdata[seq_len(input$slider1)]
    hist(data)
  })

}

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Run the app</span>
shinyApp(ui = ui, server = server)

</pre>
</div>
</div>
</div>

<div id="outline-container-org0b3eadb" class="outline-4">
<h4 id="org0b3eadb"><span class="section-number-4">6.5.2</span> <span class="todo TODO">TODO</span> Dropdown menu for messages with Dynamic message items</h4>
</div>
</div>
</div>

<div id="outline-container-org26259be" class="outline-2">
<h2 id="org26259be"><span class="section-number-2">7</span> <span class="todo TODO">TODO</span> Sales revenue app - Shiny dashboard</h2>
<div class="outline-text-2" id="text-7">
</div>
