README.html
<div id="outline-container-orge4424b9" class="outline-3">
<h3 id="orge4424b9"><span class="section-number-3">7.1</span> Reference <a href="https://datascienceplus.com/building-a-simple-sales-revenue-dashboard-with-r-shiny-shinydashboard/">link</a></h3>
</div>
<div id="outline-container-org1221296" class="outline-3">
<h3 id="org1221296"><span class="section-number-3">7.2</span> replicating the code</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2019-02-06 Wed 10:17] </span></span> <br /></li>
</ul>
</div>


<div id="outline-container-org0439be5" class="outline-4">
<h4 id="org0439be5"><span class="section-number-4">7.2.1</span> Loading libraries</h4>
<div class="outline-text-4" id="text-7-2-1">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #D0372D;">library</span>(<span style="color: #008000;">"easypackages"</span>)
libraries(<span style="color: #008000;">"shiny"</span>, <span style="color: #008000;">"shinydashboard"</span>, <span style="color: #008000;">"tidyverse"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org72c8f59" class="outline-4">
<h4 id="org72c8f59"><span class="section-number-4">7.2.2</span> Downloading raw csv and loading into variable</h4>
<div class="outline-text-4" id="text-7-2-2">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Download file to specific location</span>
system(<span style="color: #008000;">"wget \"https://raw.githubusercontent.com/amrrs/sample_revenue_dashboard_shiny/master/recommendation.csv\" -P ./sales-rev-app/"</span>)

</pre>
</div>

<p>
Reading in the csv file
</p>

<div class="org-src-container">
<pre class="src src-R">recommendation_raw  <span style="color: #D0372D;">&lt;-</span> read.csv(<span style="color: #008000;">"./sales-rev-app/recommendation.csv"</span>, stringsAsFactors = <span style="color: #6434A3;">FALSE</span>, header = <span style="color: #6434A3;">TRUE</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org4a54991" class="outline-4">
<h4 id="org4a54991"><span class="section-number-4">7.2.3</span> Init dashboard</h4>
<div class="outline-text-4" id="text-7-2-3">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Defining individual components</span>

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">header</span>
header <span style="color: #D0372D;">&lt;-</span> dashboardHeader(title = <span style="color: #008000;">"Sales Revenue Dashboard"</span>)

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">sidebar contents</span>
sidebar <span style="color: #D0372D;">&lt;-</span>
  dashboardSidebar(
    sidebarMenu(
      menuItem(<span style="color: #008000;">"Dashboard"</span>,
               icon = icon(<span style="color: #008000;">"dashboard"</span>),
               tabName = <span style="color: #008000;">"dashboard"</span>
               ),
      menuItem(<span style="color: #008000;">"Visit us"</span>,
               icon = icon(<span style="color: #008000;">"send"</span>, lib = <span style="color: #008000;">'glyphicon'</span>),
               href = <span style="color: #008000;">"https://shrysr.github.io"</span>
               )
    )
  )

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Defining individual rows</span>
frow1 <span style="color: #D0372D;">&lt;-</span> fluidRow(
  box(
    valueBoxOutput(<span style="color: #008000;">"value1"</span>),
    valueBoxOutput(<span style="color: #008000;">"value2"</span>),
    valueBoxOutput(<span style="color: #008000;">"value3"</span>)

  )
)

frow2 <span style="color: #D0372D;">&lt;-</span> fluidRow(
  box(
    title = <span style="color: #008000;">"Revenue per account"</span>,
    status = <span style="color: #008000;">"primary"</span>,
    solidHeader = <span style="color: #6434A3;">TRUE</span>,
    collapsible = <span style="color: #6434A3;">TRUE</span>,
    plotOutput(<span style="color: #008000;">"revenuebyacct"</span>, height = <span style="color: #008000;">"300px"</span>)
  )
)

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">combining the defined fluid rows into the dashboard body</span>
body <span style="color: #D0372D;">&lt;-</span> dashboardBody(frow1, frow2)

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Defining UI</span>
ui <span style="color: #D0372D;">&lt;-</span> dashboardPage(title = <span style="color: #008000;">"test title"</span>, header,sidebar, body)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Define server logic</span>

<span style="color: #006699;">server</span> <span style="color: #D0372D;">&lt;-</span> <span style="color: #0000FF;">function</span>(input, output){
  <span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Data manipulation</span>
  total_revenue <span style="color: #D0372D;">&lt;-</span> sum(recommendation_raw$revenue)
  sales_account <span style="color: #D0372D;">&lt;-</span>
    recommendation_raw <span style="color: #D0372D;">%&gt;%</span>
    group_by(Account) <span style="color: #D0372D;">%&gt;%</span>
    summarise(value = sum(Revenue)) <span style="color: #D0372D;">%&gt;%</span>
    filter(value == max(value))

  prof_prod <span style="color: #D0372D;">&lt;-</span>
    recommendation_raw <span style="color: #D0372D;">%&gt;%</span>
    group_by(Product) <span style="color: #D0372D;">%&gt;%</span>
    summarise(value = sum(Revenue)) <span style="color: #D0372D;">%&gt;%</span>
    filter(value == max(value))

  <span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Creating valuebox output</span>
  output$value1 <span style="color: #D0372D;">&lt;-</span> renderValueBox ({
    valueBox(
      formatC(sales_account$value, format = <span style="color: #008000;">"d"</span>, big.mark= <span style="color: #008000;">','</span>),
      paste(<span style="color: #008000;">'Top Account: '</span>, sales_account$Account),
      icon = icon(<span style="color: #008000;">"stats"</span>, lib =<span style="color: #008000;">'glyphicon'</span>),
      color = <span style="color: #008000;">"purple"</span>
    )
  })

  output$value2 <span style="color: #D0372D;">&lt;-</span> renderValueBox({
    valueBox(
      formatC(total_revenue, format = <span style="color: #008000;">"d"</span>, big.mark = <span style="color: #008000;">','</span>),
      paste(<span style="color: #008000;">'Top Account: '</span>, sales_account$Account),
      icon = icon(<span style="color: #008000;">"gbp"</span>, lib = <span style="color: #008000;">'glyphicon'</span>),
      color = <span style="color: #008000;">"green"</span>
    )
  })

  output$value3 <span style="color: #D0372D;">&lt;-</span> renderValueBox({
    valueBox(
      formatC(total_revenue, format = <span style="color: #008000;">"d"</span>, big.mark = <span style="color: #008000;">','</span>),
      paste(<span style="color: #008000;">"Top Product: "</span>, prof_prod$Product),
      icon = icon(<span style="color: #008000;">"menu-hamburger"</span>, lib = <span style="color: #008000;">'glyphicon'</span>),
      color = <span style="color: #008000;">"yellow"</span>
    )
  })

}

</pre>
</div>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">Run the app</span>
shinyApp(ui = ui, server = server)

</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shreyas Ragavan</p>
<p class="date">Created: 2020-01-14 Tue 15:18</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
