README.md


<a id="orgb54832c"></a>

## Reference [link](https://datascienceplus.com/building-a-simple-sales-revenue-dashboard-with-r-shiny-shinydashboard/)


<a id="orgbb991b0"></a>

## replicating the code

-   Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2019-02-06 Wed 10:17] </span></span>


<a id="org87cee5b"></a>

### Loading libraries

    library("easypackages")
    libraries("shiny", "shinydashboard", "tidyverse")


<a id="org63f93af"></a>

### Downloading raw csv and loading into variable

    ## Download file to specific location
    system("wget \"https://raw.githubusercontent.com/amrrs/sample_revenue_dashboard_shiny/master/recommendation.csv\" -P ./sales-rev-app/")

Reading in the csv file

    recommendation_raw  <- read.csv("./sales-rev-app/recommendation.csv", stringsAsFactors = FALSE, header = TRUE)


<a id="org9113d83"></a>

### Init dashboard

    ## Defining individual components

    ## header
    header <- dashboardHeader(title = "Sales Revenue Dashboard")

    ## sidebar contents
    sidebar <-
      dashboardSidebar(
        sidebarMenu(
          menuItem("Dashboard",
                   icon = icon("dashboard"),
                   tabName = "dashboard"
                   ),
          menuItem("Visit us",
                   icon = icon("send", lib = 'glyphicon'),
                   href = "https://shrysr.github.io"
                   )
        )
      )

    ## Defining individual rows
    frow1 <- fluidRow(
      box(
        valueBoxOutput("value1"),
        valueBoxOutput("value2"),
        valueBoxOutput("value3")

      )
    )

    frow2 <- fluidRow(
      box(
        title = "Revenue per account",
        status = "primary",
        solidHeader = TRUE,
        collapsible = TRUE,
        plotOutput("revenuebyacct", height = "300px")
      )
    )

    ## combining the defined fluid rows into the dashboard body
    body <- dashboardBody(frow1, frow2)

    ## Defining UI
    ui <- dashboardPage(title = "test title", header,sidebar, body)

    ## Define server logic

    server <- function(input, output){
      ## Data manipulation
      total_revenue <- sum(recommendation_raw$revenue)
      sales_account <-
        recommendation_raw %>%
        group_by(Account) %>%
        summarise(value = sum(Revenue)) %>%
        filter(value == max(value))

      prof_prod <-
        recommendation_raw %>%
        group_by(Product) %>%
        summarise(value = sum(Revenue)) %>%
        filter(value == max(value))

      ## Creating valuebox output
      output$value1 <- renderValueBox ({
        valueBox(
          formatC(sales_account$value, format = "d", big.mark= ','),
          paste('Top Account: ', sales_account$Account),
          icon = icon("stats", lib ='glyphicon'),
          color = "purple"
        )
      })

      output$value2 <- renderValueBox({
        valueBox(
          formatC(total_revenue, format = "d", big.mark = ','),
          paste('Top Account: ', sales_account$Account),
          icon = icon("gbp", lib = 'glyphicon'),
          color = "green"
        )
      })

      output$value3 <- renderValueBox({
        valueBox(
          formatC(total_revenue, format = "d", big.mark = ','),
          paste("Top Product: ", prof_prod$Product),
          icon = icon("menu-hamburger", lib = 'glyphicon'),
          color = "yellow"
        )
      })

    }

    ## Run the app
    shinyApp(ui = ui, server = server)
